# ViewReferencingDetail Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewReferencingDetail Property
ParameterTypeId Class See Also
---
"Referencing Detail"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewReferencingDetail { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewReferencingDetail As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewReferencingDetail {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace